zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_clk.c
/*
 *************************************************************************************************
 *
 * Emulation of NUC970 Clock Control module
 *
 * state: working, but currently no connection to clocks outside  
 *	  of this module
 *
 * Copyright 2006 Jochen Karrer. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 *
 *   1. Redistributions of source code must retain the above copyright notice, this list of
 *       conditions and the following disclaimer.
 *
 *   2. Redistributions in binary form must reproduce the above copyright notice, this list
 *       of conditions and the following disclaimer in the documentation and/or other materials
 *       provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY Jochen Karrer ``AS IS'' AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND
 * FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL <COPYRIGHT HOLDER> OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 * ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * The views and conclusions contained in the software and documentation are those of the
 * authors and should not be interpreted as representing official policies, either expressed
 * or implied, of Jochen Karrer.
 *
 *************************************************************************************************
 */

#include <errno.h>
#include <stdint.h>
#include <string.h>
#include <unistd.h>
#include <sys/ioctl.h>
#include <sys/fcntl.h>
#include "bus.h"
#include "signode.h"
#include "nuc970_clk.h"
#include "configfile.h"
#include "clock.h"
#include "cycletimer.h"
#include "sgstring.h"

#include "driver/nuc970.h"

/*
APLL    clock 264 MHz
UPLL    clock 300 MHz
CPU     clock 300 MHz
System  clock 300 MHz
HCLK1   clock 150 MHz
HCLK234 clock 150 MHz
PCLK    clock  75 MHz

	addReg(REG_CLK_PMCON, "CLK_PMCON", 0xFFFFFF03);
    addReg(REG_CLK_HCLKEN, "CLK_HCLKEN", 0x00000527);
    addReg(REG_CLK_PCLKEN0, "CLK_PCLKEN0", 0x0);
    addReg(REG_CLK_PCLKEN1, "CLK_PCLKEN1", 0x0);

    addReg(REG_CLK_DIVCTL0, "CLK_DIVCTL0", 0x01000018);
    addReg(REG_CLK_DIVCTL1, "CLK_DIVCTL1", 0x00000000);
    addReg(REG_CLK_DIVCTL2, "CLK_DIVCTL2", 0x00000000);
    addReg(REG_CLK_DIVCTL3, "CLK_DIVCTL3", 0x00000100);
    addReg(REG_CLK_DIVCTL4, "CLK_DIVCTL4", 0x00000000);
    addReg(REG_CLK_DIVCTL5, "CLK_DIVCTL5", 0x00000000);
    addReg(REG_CLK_DIVCTL6, "CLK_DIVCTL6", 0x00000000);
    addReg(REG_CLK_DIVCTL7, "CLK_DIVCTL7", 0x00000000);
    addReg(REG_CLK_DIVCTL8, "CLK_DIVCTL8", 0x00000295);
    addReg(REG_CLK_DIVCTL9, "CLK_DIVCTL9", 0x0000011a);

    addReg(REG_CLK_APLLCON, "CLK_APLLCON", 0x50000015);
    addReg(REG_CLK_UPLLCON, "CLK_UPLLCON", 0xc0000018);
    addReg(REG_CLK_PLLSTBCNTR, "CLK_PLLSTBCNTR", 0x00001800);

*/

INT32 sysGetPLL(UINT32 reg)
{
    UINT32 N,M,P;

    N =((inpw(reg) & 0x007F)>>0)+1;
    M =((inpw(reg) & 0x1F80)>>7)+1;
    P =((inpw(reg) & 0xE000)>>13)+1;

    return (12*N/(M*P));    /* 12MHz HXT */
}

/** \brief  Structure type of clock source
 */
typedef enum CLKn {

    SYS_UPLL     = 1,   /*!< UPLL clock */
    SYS_APLL     = 2,   /*!< APLL clock */
    SYS_SYSTEM   = 3,   /*!< System clock */
    SYS_HCLK1    = 4,   /*!< HCLK1 clock */
    SYS_HCLK234  = 5,   /*!< HCLK234 clock */
    SYS_PCLK     = 6,   /*!< PCLK clock */
    SYS_CPU      = 7,   /*!< CPU clock */

}  CLK_Type;

/**
 *  @brief  system Timer - install WDT interrupt handler
 *
 *  @param[in]  clk   clock source. \ref CLK_Type
 *
 *  @return   MHz
 */
UINT32 sysGetClock(CLK_Type clk)
{
    UINT32 src, divS, divN, reg, div;

    switch(clk)
    {
        case SYS_UPLL:
            return sysGetPLL(REG_CLK_UPLLCON);

        case SYS_APLL:
            return sysGetPLL(REG_CLK_APLLCON);

        case SYS_SYSTEM:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = 12;   /* HXT */
                    sysprintf("System Clock Source: XIN\n");
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    sysprintf("System Clock Source: ACLK\n");
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    sysprintf("System Clock Source: UCLK\n");
                    break;
                default:
                    return 0;
            }
            divS = (reg & 0x7) + 1;
            divN = ((reg & 0xf00) >> 8) + 1;
            return (src / divS / divN);
        }

        case SYS_HCLK1:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = 12;   /* HXT */
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            divS = (reg & 0x7) + 1;
            divN = ((reg & 0xf00) >> 8) + 1;
            return (src / divS / divN / 2);
        }

        case SYS_HCLK234:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = 12;   /* HXT */
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            divS = (reg & 0x7) + 1;
            divN = ((reg & 0xf00) >> 8) + 1;
            div = ((reg & 0xf00000) >> 20) + 1;
            return (src / divS / divN / 2 / div);
        }

        case SYS_PCLK:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = 12;   /* HXT */
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            divS = (reg & 0x7) + 1;
            divN = ((reg & 0xf00) >> 8) + 1;
            div = ((reg & 0xf000000) >> 24) + 1;
            return (src / divS / divN / 2 / div);
        }
        case SYS_CPU:
        {
            reg = inpw(REG_CLK_DIVCTL0);
            switch (reg & 0x18)
            {
                case 0x0:
                    src = 12;   /* HXT */
                    break;
                case 0x10:
                    src = sysGetPLL(REG_CLK_APLLCON);
                    break;
                case 0x18:
                    src = sysGetPLL(REG_CLK_UPLLCON);
                    break;
                default:
                    return 0;
            }
            divS = (reg & 0x7) + 1;
            divN = ((reg & 0xf00) >> 8) + 1;
            div = ((reg & 0xf0000) >> 16) + 1;
            return (src / divS / divN / div);
        }

        default:
            ;
    }
    return 0;
}


//#define CRM_BASE_ADDR (0x10027000)
#define CRM_CSCR(base)        ((base) + 0x0)
#define 	CSCR_PRESC_POS   (29)
#define 	CSCR_PRESC(n)     (((n) & 0x03) << CSCR_PRESC_POS)	/* MPU PLL clock prescaler */
#define 	CSCR_USB_DIV(n)   (((n) & 0x07) << 26)	/* Divider for CLK48M generation */
#define 	CSCR_SD_CNT(n)    (((n) & 0x03) << 24)	/* Shut-Down count */
#define 	CSCR_SPLL_RESTART (1 << 22)	/* Restarts the SPLL */
#define 	CSCR_MPLL_RESTART (1 << 21)	/* Restarts the MPLL */
#define 	CSCR_SSI2_SEL     (1 << 20)	/* SSI2 Baud Source Select */
#define 	CSCR_SSI1_SEL     (1 << 19)	/* SSI1 Baud Source Select */
#define 	CSCR_FIR_SEL      (1 << 18)	/* FIR and MIR clock select */
#define 	CSCR_SP_SEL       (1 << 17)	/* SPLL clock source */
#define 	CSCR_MCU_SEL      (1 << 16)	/* MPLL clock source */
#define 	CSCR_BCLKDIV_POS  10
#define 	CSCR_BCLKDIV(n)   (((n) & 0x0f) << CSCR_BCLKDIV_POS)	/* System Bus Clock Divider */
#define 	CSCR_IPDIV(n)     (((n) & 0x01) << 9)	/* Peripheral Clock Divider */
#define 	CSCR_OSC26M_DIS    (1 << 3)	/* Enables the 26 MHz oscillator */
#define 	CSCR_FPM_EN       (1 << 2)	/* Frequency Premultiplier Enable */
#define 	CSCR_SPEN         (1 << 1)	/* Serial Peripheral PLL Enable */
#define 	CSCR_MPEN         (1 << 0)	/* MPLL Enable */
#define CRM_MPCTL0(base)      ((base) + 0x4)
#define CRM_MPCTL1(base)      ((base) + 0x8)
#define		MPCTL1_BRMO 	(1<<6)
#define		MPCTL1_LF	(1<<15)
#define CRM_SPCTL0(base)      ((base) + 0xc)
#define CRM_SPCTL1(base)      ((base) + 0x10)
#define		SPCTL1_BRMO	(1<<6)
#define		SPCTL1_LF	(1<<15)
#define CRM_OSC26MCTL(base)   ((base) + 0x14)
#define		OSC26MCTL_AGC_SHIFT	(8)
#define		OSC26MCTL_AGC_MASK	(0x3f<<8)
#define		OSC26MCTL_PEAK_MASK	(3<<16)
#define		OSC26MCTL_PEAK_SHIFT	(16)
#define		OSC26M_PEAK_OK		(0<<16)
#define		OSC26M_PEAK_LOW		(1<<16)
#define		OSC26M_PEAK_HIGH	(2<<16)
#define		OSC26M_PEAK_INVALID	(3<<16)
#define CRM_PCDR0(base)       ((base) + 0x18)
#define CRM_PCDR1(base)       ((base) + 0x1c)
#define CRM_PCCR0(base)       ((base) + 0x20)
#define		PCCR0_HCLK_CSI_EN	(1<<31)
#define		PCCR0_HCLK_DMA_EN	(1<<30)
#define		PCCR0_HCLK_BROM_EN	(1<<28)
#define		PCCR0_HCLK_EMMA_EN	(1<<27)
#define		PCCR0_HCLK_LCDC_EN	(1<<26)
#define		PCCR0_HCLK_SLCDC_EN	(1<<25)
#define		PCCR0_HCLK_USBOTG_EN	(1<<24)
#define 	PCCR0_HCLK_BMI_EN	(1<<23)
#define		PCCR0_PERCLK4_EN	(1<<22)
#define		PCCR0_SLCDC_EN		(1<<21)
#define		PCCR0_FIRI_BAUD_EN	(1<<20)
#define		PCCR0_NFC_EN		(1<<19)
#define		PCCR0_PERCLK3_EN	(1<<18)
#define		PCCR0_SSI1_BAUD_EN	(1<<17)
#define		PCCR0_SSI2_BAUD_EN	(1<<16)
#define		PCCR0_EMMA_EN		(1<<15)
#define		PCCR0_USBOTG_EN		(1<<14)
#define		PCCR0_DMA_EN		(1<<13)
#define		PCCR0_I2C_EN		(1<<12)
#define		PCCR0_GPIO_EN		(1<<11)
#define		PCCR0_SDHC2_EN		(1<<10)
#define 	PCCR0_SDHC1_EN		(1<<9)
#define		PCCR0_FIRI_EN		(1<<8)
#define		PCCR0_SSI2_EN		(1<<7)
#define		PCCR0_SSI1_EN		(1<<6)
#define		PCCR0_CSPI2_EN		(1<<5)
#define		PCCR0_CSPI1_EN		(1<<4)
#define		PCCR0_UART4_EN		(1<<3)
#define		PCCR0_UART3_EN		(1<<2)
#define		PCCR0_UART2_EN		(1<<1)
#define		PCCR0_UART1_EN		(1<<0)
#define CRM_PCCR1(base)       ((base) + 0x24)
#define		PCCR1_OWIRE_EN	(1<<31)
#define		PCCR1_KPP_EN	(1<<30)
#define		PCCR1_RTC_EN	(1<<29)
#define		PCCR1_PWM_EN	(1<<28)
#define		PCCR1_GPT3_EN	(1<<27)
#define		PCCR1_GPT2_EN	(1<<26)
#define		PCCR1_GPT1_EN	(1<<25)
#define		PCCR1_WDT_EN	(1<<24)
#define		PCCR1_CSPI3_EN	(1<<23)
#define		PCCR1_RTIC_EN	(1<<22)
#define		PCCR1_RNGA_EN	(1<<21)

#define CRM_CCSR(base)        ((base) + 0x28)
#define		CCSR_32K_SR		(1<<15)
#define		CCSR_CLKO_SEL_MASK	(0x1f)
#define		CCSR_CLKO_SEL_SHIFT	(0)
#define		CCSR_CLKO_SEL(x)	((x) & 0x1f)
#if 1
/* CLKO pin selects to be used with CCSR_CLKO_SEL(n) */
#define 	CCSR_CLK0_CLK32		(0)
#define 	CCSR_CLKO_PREMCLK 	(1)
#define 	CCSR_CLKO_CLK26M	(2)
#define 	CCSR_CLKO_MPLLREFCLK	(3)
#define 	CCSR_CLKO_SPLLREFCLK	(4)
#define 	CCSR_CLKO_MPLLCLK	(5)
#define		CCSR_CLKO_SPLLCLK	(6)
#define 	CCSR_CLKO_FCLK		(7)
#define 	CCSR_CLKO_HCLK		(8)
#define		CCSR_CLKO_IPG_CLK	(9)
#define		CCSR_CLK0_PERCLK1	(10)
#define		CCSR_CLK0_PERCLK2	(11)
#define		CCSR_CLK0_PERCLK3	(12)
#define		CCSR_CLK0_PERCLK4	(13)
#define		CCSR_CLKO_SSI1BAUD	(14)
#define		CCSR_CLKO_SSI2BAUD	(15)
#define		CCSR_CLKO_NFCBAUD	(16)
#define		CCSR_CLKO_FIRI		(17)
#define		CCSR_CLK0_CLK48MALW	(18)
#define		CCSR_CLK0_CLK32KALW	(19)
#define		CCSR_CLK0_CLK48M	(20)
#define		CCSR_CLK0_CLK48DIV_CLKO	(21)
#endif
#define CRM_PMCTL(base)       ((base) + 0x2c)
#define CRM_PMCOUNT(base)     ((base) + 0x30)
#define CRM_WKGDCTL(base)     ((base) + 0x34)

