zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_clk.c
typedef struct IMX_Crm {
	BusDevice bdev;
	char *name;
	Clock_t *osc32;
	Clock_t *osc26m;
	
	Clock_t *clkXIN; // 12 MHz
	Clock_t *clkAPLLFout; //
	Clock_t *clkUPLLFout; //

	Clock_t *premclk;
	Clock_t *spll_refclk;
	Clock_t *mpll_refclk;
	Clock_t *mpll_clk;
	Clock_t *spll_clk;
	Clock_t *ipg_clk_32k;
	Clock_t *fclk;
	Clock_t *hclk;
	Clock_t *nfcclk;
	Clock_t *perclk1;
	Clock_t *perclk2;
	Clock_t *perclk3;
	Clock_t *perclk4;
	Clock_t *firiclk;
	Clock_t *clk48m;
	Clock_t *clk48div_clko;
	Clock_t *clko;
	Clock_t *ssi1clk;
	Clock_t *ssi2clk;
	Clock_t *perclk;	/* (ipg_clk) */
	Clock_t *firiinclk;	/* clk behind firsel */
	Clock_t *ssi1inclk;	/* clk behind ssi1sel */
	Clock_t *ssi2inclk;	/* clk behind ssi2sel */

	Clock_t *csi_hclk;
	Clock_t *dma_hclk;
	Clock_t *brom_hclk;
	Clock_t *emma_hclk;
	Clock_t *lcdc_hclk;
	Clock_t *slcdc_hclk;
	Clock_t *usbotg_hclk;
	Clock_t *bmi_hclk;

	/* PERCLKs enabled using pccr0 */
	Clock_t *slcdc_perclk;
	Clock_t *emma_perclk;
	Clock_t *usbotg_perclk;
	Clock_t *dma_perclk;
	Clock_t *i2c_perclk;
	Clock_t *gpio_perclk;
	Clock_t *sdhc2_perclk;
	Clock_t *sdhc1_perclk;
	Clock_t *firi_perclk;
	Clock_t *ssi2_perclk;
	Clock_t *ssi1_perclk;
	Clock_t *cspi2_perclk;
	Clock_t *cspi1_perclk;
	Clock_t *uart4_perclk;
	Clock_t *uart3_perclk;
	Clock_t *uart2_perclk;
	Clock_t *uart1_perclk;

	Clock_t *uart0_perclk;

	/* PERCLKs enabled using pccr1 */
	Clock_t *owire_perclk;
	Clock_t *kpp_perclk;
	Clock_t *rtc_perclk;
	Clock_t *pwm_perclk;
	Clock_t *gpt3_perclk;
	Clock_t *gpt2_perclk;
	Clock_t *gpt1_perclk;
	Clock_t *wdt_perclk;
	Clock_t *cspi3_perclk;
	Clock_t *rtic_perclk;
	Clock_t *rnga_perclk;

	uint32_t cscr;
	uint32_t mpctl0;
	uint32_t mpctl1;
	uint32_t spctl0;
	uint32_t spctl1;
	uint32_t osc26mctl;
	uint32_t pcdr0;
	uint32_t pcdr1;
	uint32_t pccr0;
	uint32_t pccr1;
	uint32_t ccsr;
	uint32_t pmctl;
	uint32_t pmcount;
	uint32_t wkgdctl;

	uint32_t apllcon; // APLL Control Register
	uint32_t upllcon; // UPLL Control Register

	
	CycleTimer dbgtimer;
} IMX_Crm;

static uint32_t
cscr_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->cscr;
}

static void
update_mpll_clk(IMX_Crm * crm)
{
	uint32_t value = crm->mpctl0;
	unsigned int pd;
	unsigned int mfd;
	unsigned int mfi;
	unsigned int mfn;
	uint64_t mul, div;
	float fractional_part;
	int brmo;
	pd = (value >> 26) & 0xf;
	mfd = (value >> 16) & 0x3ff;
	mfi = (value >> 10) & 0xf;
	mfn = (value & 0x3ff);
	if (mfi < 5) {
		mfi = 5;
	}
	mul = 2 * (mfi * (mfd + 1) + mfn);
	div = (mfd + 1) * (pd + 1);
	if (crm->cscr & CSCR_MPEN) {
		Clock_MakeDerived(crm->mpll_clk, crm->mpll_refclk, mul, div);
	} else {
		Clock_MakeDerived(crm->mpll_clk, crm->mpll_refclk, 0, div);
	}
	/* fractional part between ]0.1..0.9[ requires second order BRMO */
	fractional_part = mfn / (mfd + 1);
	if ((fractional_part > 0.9) || (fractional_part < 0.1)) {
		brmo = 0;
	} else {
		brmo = 1;
	}
	if (brmo != !!(crm->mpctl1 & MPCTL1_BRMO)) {
		fprintf(stderr, "MPCTL warning: fractional part is %f, BRMO bit should be %d\n",
			fractional_part, brmo);
	}
	//fprintf(stderr,"MPCTL0 mul %lld, div %lld, mfn %d, mfd %d\n",mul,div,mfn,mfd);
	//fprintf(stderr,"MPCTL0 : multiplier %f, freq %f\n",(double)mul/div,Clock_Freq(crm->mpll_clk));
}

static void
update_spll_clk(IMX_Crm * crm)
{
	uint32_t value = crm->spctl0;
	unsigned int pd;
	unsigned int mfd;
	unsigned int mfi;
	unsigned int mfn;
	uint64_t mul, div;
	float fractional_part;
	int brmo;
	pd = (value >> 26) & 0xf;
	mfd = (value >> 16) & 0x3ff;
	mfi = (value >> 10) & 0xf;
	if (mfi < 5) {
		mfi = 5;
	}
	mfn = (value >> 0) & 0x3ff;
	mul = 2 * (mfi * (mfd + 1) + mfn);
	div = (mfd + 1) * (pd + 1);
	if (crm->cscr & CSCR_SPEN) {
		Clock_MakeDerived(crm->spll_clk, crm->spll_refclk, mul, div);
	} else {
		Clock_MakeDerived(crm->spll_clk, crm->spll_refclk, 0, div);
	}
	fractional_part = mfn / (mfd + 1);
	if ((fractional_part > 0.9) || (fractional_part < 0.1)) {
		brmo = 0;
	} else {
		brmo = 1;
	}
	if (brmo != !!(crm->spctl1 & SPCTL1_BRMO)) {
		fprintf(stderr, "SPCTL warning: fractional part is %f, BRMO bit should be %d\n",
			fractional_part, brmo);
	}
	//fprintf(stderr,"SPCTL0 : multiplier %f, freq %f\n",(double)mul/div,Clock_Freq(crm->spll_clk));
}

static void
cscr_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;

	fprintf(stderr, "CLK_PMCON write [%08x] %08x\n", address, value);

	int presc = (value >> 29) & 7;
	int usb_div = (value >> 26) & 7;
	//int sd_cnt = (value >> 24) & 3;
	int spll_restart = (value >> 22) & 1;
	int mpll_restart = (value >> 21) & 1;
	int ssi2_sel = (value >> 20) & 1;
	int ssi1_sel = (value >> 19) & 1;
	int fir_sel = (value >> 18) & 1;
	int sp_sel = (value >> 17) & 1;
	int mcu_sel = (value >> 16) & 1;
	int bclkdiv = (value >> 10) & 0xf;
	int ipdiv = (value >> 9) & 1;
	int osc26m_div1p5 = (value >> 4) & 1;
	int osc26m_dis = (value >> 3) & 1;
	int fpm_en = (value >> 2) & 1;
	crm->cscr = value & 0xff7f3e1f;
	/* Should be delayed by 1-2 CLK32 cycles */
	crm->cscr &= ~(CSCR_MPLL_RESTART | CSCR_SPLL_RESTART);
	if (osc26m_dis) {
		Clock_SetFreq(crm->osc26m, 0);
	} else {
		uint32_t freq;
		if (Config_ReadUInt32(&freq, crm->name, "osc26") < 0) {
			freq = 0;
		}
		Clock_SetFreq(crm->osc26m, freq);
	}
	if (fpm_en) {
		Clock_MakeDerived(crm->premclk, crm->osc32, 512, 1);
	} else {
		Clock_MakeDerived(crm->premclk, crm->osc32, 0, 1);
	}
	if (mcu_sel) {
		if (osc26m_div1p5) {
			Clock_MakeDerived(crm->mpll_refclk, crm->osc26m, 2, 3);
		} else {
			Clock_MakeDerived(crm->mpll_refclk, crm->osc26m, 1, 1);
		}
	} else {
		Clock_MakeDerived(crm->mpll_refclk, crm->premclk, 1, 1);
	}
	if (sp_sel) {
		Clock_MakeDerived(crm->spll_refclk, crm->osc26m, 1, 1);
	} else {
		Clock_MakeDerived(crm->spll_refclk, crm->premclk, 1, 1);
	}
	update_mpll_clk(crm);
	update_spll_clk(crm);
	Clock_MakeDerived(crm->fclk, crm->mpll_clk, 1, presc + 1);
	Clock_MakeDerived(crm->hclk, crm->fclk, 1, bclkdiv + 1);
	if (fir_sel) {
		Clock_Decouple(crm->firiinclk);
		Clock_MakeDerived(crm->firiinclk, crm->spll_clk, 1, 1);
	} else {
		Clock_Decouple(crm->firiinclk);
		Clock_MakeDerived(crm->firiinclk, crm->mpll_clk, 1, 1);
	}
	if (ssi1_sel) {
		Clock_Decouple(crm->ssi1inclk);
		Clock_MakeDerived(crm->ssi1inclk, crm->mpll_clk, 1, 1);
	} else {
		Clock_Decouple(crm->ssi1inclk);
		Clock_MakeDerived(crm->ssi1inclk, crm->spll_clk, 1, 1);
	}
	if (ssi2_sel) {
		Clock_Decouple(crm->ssi2inclk);
		Clock_MakeDerived(crm->ssi2inclk, crm->mpll_clk, 1, 1);
	} else {
		Clock_Decouple(crm->ssi2inclk);
		Clock_MakeDerived(crm->ssi2inclk, crm->spll_clk, 1, 1);
	}
	Clock_MakeDerived(crm->perclk, crm->hclk, 1, ipdiv + 1);
	Clock_MakeDerived(crm->clk48m, crm->spll_clk, 1, usb_div + 1);
	if (spll_restart || mpll_restart) {
		//      Clock_DumpTree(crm->osc26m);
		//      Clock_DumpTree(crm->osc32);
	}
	return;
}

static uint32_t
mpctl0_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->mpctl0;
}

static void
mpctl0_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	//fprintf(stderr,"MPCTL0: %08x\n",value);
	crm->mpctl0 = value & 0xbfff3fff;
	update_mpll_clk(crm);
	return;
}

static uint32_t
mpctl1_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->mpctl1 | MPCTL1_LF;
}

static void
mpctl1_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->mpctl1 = value & (MPCTL1_BRMO);
	//fprintf(stderr,"MPCTL1: %08x\n",value);
	return;
}

static uint32_t
spctl0_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->spctl0;
}

static void
spctl0_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->spctl0 = value & 0xbfff3fff;
	update_spll_clk(crm);
	//fprintf(stderr,"SPCTL0: %08x\n",value);
	return;
}

static uint32_t
spctl1_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->spctl1 | SPCTL1_LF;
}

static void
spctl1_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->spctl1 = value & SPCTL1_BRMO;
	return;
}

static uint32_t
osc26mctl_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	int agc = (crm->osc26mctl & OSC26MCTL_AGC_MASK) >> OSC26MCTL_AGC_SHIFT;
	uint32_t peak;
	if ((crm->cscr & CSCR_OSC26M_DIS) || (Clock_Freq(crm->osc26m) == 0)) {
		/* verified with real board without osc26 + cscr disabled */
		peak = OSC26M_PEAK_INVALID;
	} else if (agc > 0x22) {
		peak = OSC26M_PEAK_HIGH;
	} else if (agc < 0x1a) {
		peak = OSC26M_PEAK_LOW;
	} else {
		peak = OSC26M_PEAK_OK;
	}
	//fprintf(stderr,"agc %d, peak %04x\n",agc,peak);
	crm->osc26mctl &= ~(3 << 16);
	crm->osc26mctl |= peak;	/* always in desired range */
	return crm->osc26mctl;
}

static void
osc26mctl_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->osc26mctl = value & 0x3f00;
	return;
}

static void
update_perdivs(IMX_Crm * crm)
{
	uint32_t pcdr0 = crm->pcdr0;
	uint32_t pcdr1 = crm->pcdr1;
	int perdiv1 = pcdr1 & 0x3f;
	int perdiv2 = (pcdr1 >> 8) & 0x3f;
	int perdiv3 = (pcdr1 >> 16) & 0x3f;
	int perdiv4 = (pcdr1 >> 24) & 0x3f;

	int ssi2div = (pcdr0 >> 26) & 0x3f;
	int ssi1div = (pcdr0 >> 16) & 0x3f;
	int nfcdiv = (pcdr0 >> 12) & 0xf;
	int clko_48mdiv = (pcdr0 >> 5) & 7;
	int firi_div = (pcdr0 >> 0) & 0x1f;

