zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_clk.c
	Clock_MakeDerived(crm->clk48div_clko, crm->clk48m, 1, clko_48mdiv + 1);
	Clock_MakeDerived(crm->perclk1, crm->mpll_clk, 1, perdiv1 + 1);
	Clock_MakeDerived(crm->perclk2, crm->mpll_clk, 1, perdiv2 + 1);
	if (crm->pccr0 & PCCR0_PERCLK3_EN) {
		Clock_MakeDerived(crm->perclk3, crm->mpll_clk, 1, perdiv3 + 1);
	} else {
		Clock_MakeDerived(crm->perclk3, crm->mpll_clk, 0, perdiv3 + 1);
	}
	if (crm->pccr0 & PCCR0_PERCLK4_EN) {
		Clock_MakeDerived(crm->perclk4, crm->mpll_clk, 1, perdiv4 + 1);
	} else {
		Clock_MakeDerived(crm->perclk4, crm->mpll_clk, 0, perdiv4 + 1);
	}
	if (crm->pccr0 & PCCR0_FIRI_BAUD_EN) {
		Clock_MakeDerived(crm->firiclk, crm->firiinclk, 1, firi_div + 1);
	} else {
		Clock_MakeDerived(crm->firiclk, crm->firiinclk, 0, 1);
	}
	if (crm->pccr0 & PCCR0_NFC_EN) {
		Clock_MakeDerived(crm->nfcclk, crm->fclk, 1, nfcdiv + 1);
	} else {
		Clock_MakeDerived(crm->nfcclk, crm->fclk, 0, 1);
	}
	if (crm->pccr0 & PCCR0_SSI1_BAUD_EN) {
		if (ssi1div <= 1) {
			Clock_MakeDerived(crm->ssi1clk, crm->ssi1inclk, 1, 62);
		} else {
			Clock_MakeDerived(crm->ssi1clk, crm->ssi1inclk, 2, ssi1div);
		}
	} else {
		Clock_MakeDerived(crm->ssi1clk, crm->ssi1inclk, 0, 1);
	}
	if (crm->pccr0 & PCCR0_SSI2_BAUD_EN) {
		if (ssi2div <= 1) {
			Clock_MakeDerived(crm->ssi2clk, crm->ssi2inclk, 1, 62);
		} else {
			Clock_MakeDerived(crm->ssi2clk, crm->ssi2inclk, 2, ssi2div);
		}
	} else {
		Clock_MakeDerived(crm->ssi2clk, crm->ssi2inclk, 0, 1);
	}
	/*      fprintf(stderr,"** perclk1: freq %d\n",Clock_Freq(crm->perclk1));       */
	/*      fprintf(stderr,"** mpll_clk: freq %d\n",Clock_Freq(crm->mpll_clk));     */
}

static uint32_t
pcdr0_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->pcdr0;
}

static void
pcdr0_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->pcdr0 = value & 0xfc3ff0ff;
	update_perdivs(crm);
	return;
}

static uint32_t
CLK_PCLKEN0_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->pcdr0;
}

static void
CLK_PCLKEN0_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->pcdr0 = value;
	fprintf(stderr, "PCLKEN0: %08x\n", value);
	return;
}

static uint32_t
pcdr1_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->pcdr1;
}

static void
pcdr1_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->pcdr1 = value & 0x3f3f3f3f;
	update_perdivs(crm);
	return;
}

static uint32_t
pccr0_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->pccr0;
}

static void
pccr0_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->pccr0 = value | (1 << 29);
	update_perdivs(crm);
	if (value & PCCR0_HCLK_CSI_EN) {
		Clock_MakeDerived(crm->csi_hclk, crm->hclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->csi_hclk, crm->hclk, 0, 1);
	}
	if (value & PCCR0_HCLK_DMA_EN) {
		Clock_MakeDerived(crm->dma_hclk, crm->hclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->dma_hclk, crm->hclk, 0, 1);
	}
	if (value & PCCR0_HCLK_BROM_EN) {
		Clock_MakeDerived(crm->brom_hclk, crm->hclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->brom_hclk, crm->hclk, 0, 1);
	}
	if (value & PCCR0_HCLK_EMMA_EN) {
		Clock_MakeDerived(crm->emma_hclk, crm->hclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->emma_hclk, crm->hclk, 0, 1);
	}
	if (value & PCCR0_HCLK_LCDC_EN) {
		Clock_MakeDerived(crm->lcdc_hclk, crm->hclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->lcdc_hclk, crm->hclk, 0, 1);
	}
	if (value & PCCR0_HCLK_SLCDC_EN) {
		Clock_MakeDerived(crm->slcdc_hclk, crm->hclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->slcdc_hclk, crm->hclk, 0, 1);
	}
	if (value & PCCR0_HCLK_USBOTG_EN) {
		Clock_MakeDerived(crm->usbotg_hclk, crm->hclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->usbotg_hclk, crm->hclk, 0, 1);
	}
	if (value & PCCR0_HCLK_BMI_EN) {
		Clock_MakeDerived(crm->bmi_hclk, crm->hclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->bmi_hclk, crm->hclk, 0, 1);
	}
	/* PERCLKs */
	if (value & PCCR0_SLCDC_EN) {
		Clock_MakeDerived(crm->slcdc_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->slcdc_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_EMMA_EN) {
		Clock_MakeDerived(crm->emma_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->emma_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_USBOTG_EN) {
		Clock_MakeDerived(crm->usbotg_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->usbotg_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_DMA_EN) {
		Clock_MakeDerived(crm->dma_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->dma_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_I2C_EN) {
		Clock_MakeDerived(crm->i2c_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->i2c_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_GPIO_EN) {
		Clock_MakeDerived(crm->gpio_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->gpio_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_SDHC2_EN) {
		Clock_MakeDerived(crm->sdhc2_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->sdhc2_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_SDHC1_EN) {
		Clock_MakeDerived(crm->sdhc1_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->sdhc1_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_FIRI_EN) {
		Clock_MakeDerived(crm->firi_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->firi_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_SSI2_EN) {
		Clock_MakeDerived(crm->ssi2_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->ssi2_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_SSI1_EN) {
		Clock_MakeDerived(crm->ssi1_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->ssi1_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_CSPI2_EN) {
		Clock_MakeDerived(crm->cspi2_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->cspi2_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_CSPI1_EN) {
		Clock_MakeDerived(crm->cspi1_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->cspi1_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_UART4_EN) {
		Clock_MakeDerived(crm->uart4_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->uart4_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_UART3_EN) {
		Clock_MakeDerived(crm->uart3_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->uart3_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_UART2_EN) {
		Clock_MakeDerived(crm->uart2_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->uart2_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR0_UART1_EN) {
		Clock_MakeDerived(crm->uart1_perclk, crm->clkXIN, 1, 1);
	} else {
		Clock_MakeDerived(crm->uart1_perclk, crm->clkXIN, 0, 1);
	}
	return;
}

static uint32_t
pccr1_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	return crm->pccr1;
}

static void
pccr1_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->pccr1 = value & 0xffe00000;
	if (value & PCCR1_OWIRE_EN) {
		Clock_MakeDerived(crm->owire_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->owire_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_KPP_EN) {
		Clock_MakeDerived(crm->kpp_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->kpp_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_RTC_EN) {
		Clock_MakeDerived(crm->rtc_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->rtc_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_PWM_EN) {
		Clock_MakeDerived(crm->pwm_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->pwm_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_GPT3_EN) {
		Clock_MakeDerived(crm->gpt3_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->gpt3_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_GPT2_EN) {
		Clock_MakeDerived(crm->gpt2_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->gpt2_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_GPT1_EN) {
		Clock_MakeDerived(crm->gpt1_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->gpt1_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_WDT_EN) {
		Clock_MakeDerived(crm->wdt_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->wdt_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_CSPI3_EN) {
		Clock_MakeDerived(crm->cspi3_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->cspi3_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_RTIC_EN) {
		Clock_MakeDerived(crm->rtic_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->rtic_perclk, crm->perclk, 0, 1);
	}
	if (value & PCCR1_RNGA_EN) {
		Clock_MakeDerived(crm->rnga_perclk, crm->perclk, 1, 1);
	} else {
		Clock_MakeDerived(crm->rnga_perclk, crm->perclk, 0, 1);
	}
	return;
}

static uint32_t
ccsr_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	fprintf(stderr, "CCSR (0x%08x) implementation is incomplete\n", address);
	return crm->ccsr;
}

static void
ccsr_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	uint32_t clko_sel;
	crm->ccsr = (value & 0x1f) | (3 << 8);
	clko_sel = value & 0x1f;
	Clock_Decouple(crm->clko);
	switch (clko_sel) {
	    case CCSR_CLK0_CLK32:
		    Clock_MakeDerived(crm->clko, crm->osc32, 1, 1);
		    break;

