zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_clk.c
	    case CCSR_CLKO_PREMCLK:
		    Clock_MakeDerived(crm->clko, crm->premclk, 1, 1);
		    break;

	    case CCSR_CLKO_CLK26M:
		    Clock_MakeDerived(crm->clko, crm->osc26m, 1, 1);
		    break;

	    case CCSR_CLKO_MPLLREFCLK:
		    Clock_MakeDerived(crm->clko, crm->mpll_refclk, 1, 1);
		    break;
	    case CCSR_CLKO_SPLLREFCLK:
		    Clock_MakeDerived(crm->clko, crm->spll_refclk, 1, 1);
		    break;
	    case CCSR_CLKO_MPLLCLK:
		    Clock_MakeDerived(crm->clko, crm->mpll_clk, 1, 1);
		    break;
	    case CCSR_CLKO_SPLLCLK:
		    Clock_MakeDerived(crm->clko, crm->spll_clk, 1, 1);
		    break;
	    case CCSR_CLKO_FCLK:
		    Clock_MakeDerived(crm->clko, crm->fclk, 1, 1);
		    break;
	    case CCSR_CLKO_HCLK:
		    Clock_MakeDerived(crm->clko, crm->hclk, 1, 1);
		    break;
	    case CCSR_CLKO_IPG_CLK:
		    Clock_MakeDerived(crm->clko, crm->perclk, 1, 1);
		    break;

	    case CCSR_CLK0_PERCLK1:
		    Clock_MakeDerived(crm->clko, crm->perclk1, 1, 1);
		    break;
	    case CCSR_CLK0_PERCLK2:
		    Clock_MakeDerived(crm->clko, crm->perclk2, 1, 1);
		    break;
	    case CCSR_CLK0_PERCLK3:
		    Clock_MakeDerived(crm->clko, crm->perclk3, 1, 1);
		    break;
	    case CCSR_CLK0_PERCLK4:
		    Clock_MakeDerived(crm->clko, crm->perclk4, 1, 1);
		    break;
	    case CCSR_CLKO_SSI1BAUD:
		    Clock_MakeDerived(crm->clko, crm->ssi1clk, 1, 1);
		    break;
	    case CCSR_CLKO_SSI2BAUD:
		    Clock_MakeDerived(crm->clko, crm->ssi2clk, 1, 1);
		    break;
	    case CCSR_CLKO_NFCBAUD:
		    Clock_MakeDerived(crm->clko, crm->nfcclk, 1, 1);
		    break;
	    case CCSR_CLKO_FIRI:
		    Clock_MakeDerived(crm->clko, crm->firiclk, 1, 1);
		    break;

	    case CCSR_CLK0_CLK48MALW:
		    /* What is always ??? */
		    Clock_MakeDerived(crm->clko, crm->clk48m, 1, 1);
		    break;
	    case CCSR_CLK0_CLK32KALW:
		    /* What is always ??? */
		    Clock_MakeDerived(crm->clko, crm->osc32, 1, 1);
		    break;
	    case CCSR_CLK0_CLK48M:
		    /* What is not always ??? */
		    Clock_MakeDerived(crm->clko, crm->clk48m, 1, 1);
		    break;

	    case CCSR_CLK0_CLK48DIV_CLKO:
		    Clock_MakeDerived(crm->clko, crm->clk48div_clko, 1, 1);
		    break;
	    default:
		    fprintf(stderr, "Unknown CLKO_SEL %d\n", clko_sel);
		    break;
	}
	return;
}

static uint32_t
pmctl_read(void *clientData, uint32_t address, int rqlen)
{
	// IMX_Crm *crm = (IMX_Crm *) clientData;
	fprintf(stderr, "read %08x not implemented\n", address);
	return 0;
}

static void
pmctl_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	// IMX_Crm *crm = (IMX_Crm *) clientData;
	fprintf(stderr, "write %08x not implemented\n", address);
	return;
}

static uint32_t
pmcount_read(void *clientData, uint32_t address, int rqlen)
{
	//  IMX_Crm *crm = (IMX_Crm *) clientData;
	fprintf(stderr, "read %08x not implemented\n", address);
	return 0;
}

static void
pmcount_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	// IMX_Crm *crm = (IMX_Crm *) clientData;
	fprintf(stderr, "write %08x not implemented\n", address);
	return;
}

static uint32_t
wkgdctl_read(void *clientData, uint32_t address, int rqlen)
{
	//  IMX_Crm *crm = (IMX_Crm *) clientData;
	fprintf(stderr, "read %08x not implemented\n", address);
	return 0;
}

static void
wkgdctl_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	// IMX_Crm *crm = (IMX_Crm *) clientData;
	fprintf(stderr, "write %08x not implemented\n", address);
	return;
}

static uint32_t
undefined_read(void *clientData, uint32_t address, int rqlen)
{
	fprintf(stderr, "WARNING !: read from undefined location 0x%08x in CRM module\n", address);
	return 0;
}

static void
undefined_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	fprintf(stderr, "WARNING !: write to undefined location 0x%08x in CRM module\n", address);
	return;
}

static uint32_t
APLLCON_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *)clientData;
	return crm->apllcon;
}

static void
APLLCON_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->apllcon = value;
	return;
}

static uint32_t
UPLLCON_read(void *clientData, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *)clientData;
	return crm->upllcon;
}

static void
UPLLCON_write(void *clientData, uint32_t value, uint32_t address, int rqlen)
{
	IMX_Crm *crm = (IMX_Crm *) clientData;
	crm->upllcon = value;
	return;
}

static void
IMXCrm_Map(void *owner, uint32_t base, uint32_t mask, uint32_t flags)
{
	IMX_Crm *crm = (IMX_Crm *) owner;

	IOH_New32(CRM_CSCR(base), cscr_read, cscr_write, crm);
	IOH_New32(CRM_MPCTL0(base), mpctl0_read, mpctl0_write, crm);
	IOH_New32(CRM_MPCTL1(base), mpctl1_read, mpctl1_write, crm);
	IOH_New32(CRM_SPCTL0(base), spctl0_read, spctl0_write, crm);
	IOH_New32(CRM_SPCTL1(base), spctl1_read, spctl1_write, crm);
	IOH_New32(CRM_OSC26MCTL(base), osc26mctl_read, osc26mctl_write, crm);
	//IOH_New32(CRM_PCDR0(base), pcdr0_read, pcdr0_write, crm);
	IOH_New32(CRM_PCDR1(base), pcdr1_read, pcdr1_write, crm);
	IOH_New32(CRM_PCCR0(base), pccr0_read, pccr0_write, crm);
	IOH_New32(CRM_PCCR1(base), pccr1_read, pccr1_write, crm);
	IOH_New32(CRM_CCSR(base), ccsr_read, ccsr_write, crm);
	IOH_New32(CRM_PMCTL(base), pmctl_read, pmctl_write, crm);
	IOH_New32(CRM_PMCOUNT(base), pmcount_read, pmcount_write, crm);
	IOH_New32(CRM_WKGDCTL(base), wkgdctl_read, wkgdctl_write, crm);

	IOH_New32(REG_CLK_PCLKEN0, CLK_PCLKEN0_read, CLK_PCLKEN0_write, crm);

	IOH_New32(REG_CLK_APLLCON, APLLCON_read, APLLCON_write, crm);
	IOH_New32(REG_CLK_UPLLCON, UPLLCON_read, UPLLCON_write, crm);
	
	
}

static void
IMXCrm_UnMap(void *owner, uint32_t base, uint32_t mask)
{
	IOH_Delete32(CRM_CSCR(base));
	IOH_Delete32(CRM_MPCTL0(base));
	IOH_Delete32(CRM_MPCTL1(base));
	IOH_Delete32(CRM_SPCTL0(base));
	IOH_Delete32(CRM_SPCTL1(base));
	IOH_Delete32(CRM_OSC26MCTL(base));
	IOH_Delete32(CRM_PCDR0(base));
	IOH_Delete32(CRM_PCDR1(base));
	IOH_Delete32(CRM_PCCR0(base));
	IOH_Delete32(CRM_PCCR1(base));
	IOH_Delete32(CRM_CCSR(base));
	IOH_Delete32(CRM_PMCTL(base));
	IOH_Delete32(CRM_PMCOUNT(base));
	IOH_Delete32(CRM_WKGDCTL(base));
	
	IOH_Delete32(REG_CLK_PCLKEN0);

