zihui89w/leigun/modules/softgun/controllers/nuc970/nuc970_clk.c
	IOH_Delete32(REG_CLK_APLLCON);
	IOH_Delete32(REG_CLK_UPLLCON);
}

static void
dump_proc(void *cd)
{
//      IMX_Crm *crm = (IMX_Crm*)cd;
//      Clock_DumpTree(crm->osc32);
}

BusDevice *
NUC970Clk_New(const char *name)
{
	IMX_Crm *crm = sg_new(IMX_Crm);
	uint32_t osc32_freq;

	crm->name = sg_strdup(name);
	if (!crm->name) {
		fprintf(stderr, "Out of memory for CLK name\n");
		exit(1);
	}

	crm->apllcon = 0x50000015;
	crm->upllcon = 0xc0000018;

	crm->cscr = 0xffffff03;//0x77180607;
	crm->mpctl0 = 0x00071c07;
	crm->mpctl1 = 0x00008000;
	crm->spctl0 = 0x807f2065;
	crm->spctl1 = 0x00008000;
	crm->osc26mctl = 0x00003f00;
	crm->pcdr0 = 0x64193007;
	crm->pcdr1 = 0x0307070f;
	crm->pccr0 = 0x31084003;
	crm->pccr1 = 0x0;
	crm->ccsr = 0x300;
	crm->wkgdctl = 0;

	// clocks
	crm->osc32 = Clock_New("%s.clk32", name);
	crm->osc26m = Clock_New("%s.clk26", name);

	crm->clkXIN = Clock_New("%s.clkXIN", name);
	crm->clkAPLLFout = Clock_New("");

	crm->premclk = Clock_New("%s.premclk", name);
	crm->spll_refclk = Clock_New("%s.spll_refclk", name);
	crm->mpll_refclk = Clock_New("%s.mpll_refclk", name);
	crm->mpll_clk = Clock_New("%s.mpll_clk", name);
	crm->spll_clk = Clock_New("%s.spll_clk", name);
	crm->ipg_clk_32k = Clock_New("%s.ipg_clk_32", name);
	crm->fclk = Clock_New("%s.fclk", name);
	crm->hclk = Clock_New("%s.hclk", name);
	crm->nfcclk = Clock_New("%s.nfcclk", name);
	crm->perclk1 = Clock_New("%s.perclk1", name);
	crm->perclk2 = Clock_New("%s.perclk2", name);
	crm->perclk3 = Clock_New("%s.perclk3", name);
	crm->perclk4 = Clock_New("%s.perclk4", name);
	crm->firiclk = Clock_New("%s.firiclk", name);
	crm->clk48m = Clock_New("%s.clk48m", name);
	crm->clk48div_clko = Clock_New("%s.clk48div_clko", name);
	crm->clko = Clock_New("%s.clko", name);
	crm->ssi1clk = Clock_New("%s.ssi1clk", name);
	crm->ssi2clk = Clock_New("%s.ssi2clk", name);
	crm->perclk = Clock_New("%s.perclk", name);	/* (ipg_clk) */
	crm->firiinclk = Clock_New("%s.firiinclk", name);
	crm->ssi1inclk = Clock_New("%s.ssi1inclk", name);
	crm->ssi2inclk = Clock_New("%s.ssi2inclk", name);

	/* HCLKs */
	crm->csi_hclk = Clock_New("%s.csi_hclk", name);
	crm->dma_hclk = Clock_New("%s.dma_hclk", name);
	crm->brom_hclk = Clock_New("%s.brom_hclk", name);
	crm->emma_hclk = Clock_New("%s.emma_hclk", name);
	crm->lcdc_hclk = Clock_New("%s.lcdc_hclk", name);
	crm->slcdc_hclk = Clock_New("%s.slcdc_hclk", name);
	crm->usbotg_hclk = Clock_New("%s.usbotg_hclk", name);
	crm->bmi_hclk = Clock_New("%s.bmi_hclk", name);
	/* PERCLKs */
	crm->slcdc_perclk = Clock_New("%s.slcdc_perclk", name);
	crm->emma_perclk = Clock_New("%s.emma_perclk", name);
	crm->usbotg_perclk = Clock_New("%s.usbotg_perclk", name);
	crm->dma_perclk = Clock_New("%s.dma_perclk", name);
	crm->i2c_perclk = Clock_New("%s.i2c_perclk", name);
	crm->gpio_perclk = Clock_New("%s.gpio_perclk", name);
	crm->sdhc2_perclk = Clock_New("%s.sdhc2_perclk", name);
	crm->sdhc1_perclk = Clock_New("%s.sdhc1_perclk", name);
	crm->firi_perclk = Clock_New("%s.firi_perclk", name);
	crm->ssi2_perclk = Clock_New("%s.ssi2_perclk", name);
	crm->ssi1_perclk = Clock_New("%s.ssi1_perclk", name);
	crm->cspi2_perclk = Clock_New("%s.cspi2_perclk", name);
	crm->cspi1_perclk = Clock_New("%s.cspi1_perclk", name);
	crm->uart4_perclk = Clock_New("%s.uart4_perclk", name);
	crm->uart3_perclk = Clock_New("%s.uart3_perclk", name);
	crm->uart2_perclk = Clock_New("%s.uart2_perclk", name);
	crm->uart1_perclk = Clock_New("%s.uart1_perclk", name);

	crm->owire_perclk = Clock_New("%s.owire_perclk", name);
	crm->kpp_perclk = Clock_New("%s.kpp_perclk", name);
	crm->rtc_perclk = Clock_New("%s.rtc_perclk", name);
	crm->pwm_perclk = Clock_New("%s.pwm_perclk", name);
	crm->gpt3_perclk = Clock_New("%s.gpt3_perclk", name);
	crm->gpt2_perclk = Clock_New("%s.gpt2_perclk", name);
	crm->gpt1_perclk = Clock_New("%s.gpt1_perclk", name);
	crm->wdt_perclk = Clock_New("%s.wdt_perclk", name);
	crm->cspi3_perclk = Clock_New("%s.cspi3_perclk", name);
	crm->rtic_perclk = Clock_New("%s.rtic_perclk", name);
	crm->rnga_perclk = Clock_New("%s.rnga_perclk", name);

	/* The 32k Osc is always running, the 26MHz is controlled by CSCR */
	if (Config_ReadUInt32(&osc32_freq, crm->name, "osc32") < 0) {
		osc32_freq = 32768;
	}
	Clock_SetFreq(crm->osc32, osc32_freq);
	Clock_SetFreq(crm->clkXIN, 12000000);
	
	crm->bdev.first_mapping = NULL;
	crm->bdev.Map = IMXCrm_Map;
	crm->bdev.UnMap = IMXCrm_UnMap;
	crm->bdev.owner = crm;
	crm->bdev.hw_flags = MEM_FLAG_WRITABLE | MEM_FLAG_READABLE;

	//cscr_write(crm, crm->cscr, 0, 4);
	pccr0_write(crm, crm->pccr0, 0, 4);
	pccr1_write(crm, crm->pccr1, 0, 4);
	pcdr0_write(crm, crm->pcdr0, 0, 4);
	pcdr1_write(crm, crm->pcdr1, 0, 4);
	ccsr_write(crm, crm->ccsr, 0, 4);

	fprintf(stderr, "NUC970 Clock Control module \"%s\" created\n", name);

	UINT32 N,M,P;

    N =((crm->apllcon & 0x007F)>>0)+1;
    M =((crm->apllcon & 0x1F80)>>7)+1;
    P =((crm->apllcon & 0xE000)>>13)+1;
	fprintf(stderr, "APLL Clock Freq: %d, MUL: %d, DRI: %d\n", (12*N/(M*P)), N, M*P);
	Clock_MakeDerived(crm->clkAPLLFout, crm->clkXIN, N, M*P);

	N =((crm->upllcon & 0x007F)>>0)+1;
    M =((crm->upllcon & 0x1F80)>>7)+1;
    P =((crm->upllcon & 0xE000)>>13)+1;
	Clock_MakeDerived(crm->clkUPLLFout, crm->clkXIN, N, M*P);


	//CycleTimer_Add(&crm->dbgtimer,(uint64_t)285000000*10,dump_proc,crm);
	CycleTimer_Add(&crm->dbgtimer, (uint64_t) 3, dump_proc, crm);

	//Clock_DumpTree(crm->osc26m);
	Clock_DumpTree(crm->osc32);
	Clock_DumpTree(crm->clkXIN);

	return &crm->bdev;
}
